//Напишите программу, которая на вход
//принимает число и выдает его квадрат (число
//умноженное на само себя).

int num = int.Parse(Console.ReadLine());
int numResult = num * num;
Console.WriteLine(numResult);
